wagiminator/Development-Boards/STC8H1K08_DevBoard/software/serial/include/stc8h.h
// ===================================================================================
// Header File for STC8H Microcontrollers                                     * v1.0 *
// ===================================================================================

#pragma once
#include <stdint.h>

#define __BIT   __bit
#define __DATA  __data
#define __IDATA __idata
#define __PDATA __pdata
#define __XDATA __xdata
#define __CODE  __code
#define __REENTRANT  __reentrant

#define SBIT(name, addr, bit)         __sbit  __at(addr+bit) name
#define SFR(name, addr)               __sfr   __at(addr) name
#define SFRX(addr)                    (*(uint8_t  volatile __xdata *)(addr))
#define SFR16X(addr)                  (*(uint16_t volatile __xdata *)(addr))

#define SFRX_ON()                     P_SW2 |= 0x80
#define SFRX_OFF()                    P_SW2 &= 0x7f
#define SFRX_SET(__SFR__, __POS__)    {SFRX_ON();(__SFR__)|= (0x01<<(__POS__));SFRX_OFF();}
#define SFRX_RESET(__SFR__, __POS__)  {SFRX_ON();(__SFR__)&=~(0x01<<(__POS__));SFRX_OFF();}
#define SFRX_WRITE(__SFR__, __VAL__)  {SFRX_ON();(__SFR__)=(__POS__);SFRX_OFF();}

#define NOP()                         __asm NOP __endasm

#define INTERRUPT(name, vector) void name(void) __interrupt(vector)
#define INTERRUPT_USING(name, vector, regnum) void name(void) __interrupt(vector) __using(regnum)

// Interrupt numbers
#define INT_NO_INT0       0         // interrupt number for INT0
#define INT_NO_TMR0       1         // interrupt number for timer0
#define INT_NO_INT1       2         // interrupt number for INT1
#define INT_NO_TMR1       3         // interrupt number for timer1
#define INT_NO_UART1      4         // interrupt number for UART1
#define INT_NO_ADC        5         // interrupt number for ADC
#define INT_NO_LVD        6         // interrupt number for LVD
#define INT_NO_PCA        7         // interrupt number for PCA
#define INT_NO_UART2      8         // interrupt number for UART2
#define INT_NO_SPI        9         // interrupt number for SPI
#define INT_NO_INT2       10        // interrupt number for INT2
#define INT_NO_INT3       11        // interrupt number for INT3
#define INT_NO_TMR2       12        // interrupt number for timer2
#define INT_NO_INT4       16        // interrupt number for INT4
#define INT_NO_UART3      17        // interrupt number for UART3
#define INT_NO_UART4      18        // interrupt number for UART4
#define INT_NO_TMR3       19        // interrupt number for timer3
#define INT_NO_TMR4       20        // interrupt number for timer4
#define INT_NO_CMP        21        // interrupt number for CMP
#define INT_NO_I2C        24        // interrupt number for I2C
#define INT_NO_USB        25        // interrupt number for USB
#define INT_NO_PWMA       26        // interrupt number for PWMA
#define INT_NO_PWMB       27        // interrupt number for PWMB
#define INT_NO_TKSU       35        // interrupt number for TKSU
#define INT_NO_RTC        36        // interrupt number for RTC
#define INT_NO_P0         37        // interrupt number for P0
#define INT_NO_P1         38        // interrupt number for P1
#define INT_NO_P2         39        // interrupt number for P2
#define INT_NO_P3         40        // interrupt number for P3
#define INT_NO_P4         41        // interrupt number for P4
#define INT_NO_P5         42        // interrupt number for P5
#define INT_NO_P6         43        // interrupt number for P6
#define INT_NO_P7         44        // interrupt number for P7
#define INT_NO_DMA_M2M    47        // interrupt number for DMA memcopy
#define INT_NO_DMA_ADC    48        // interrupt number for DMA ADC
#define INT_NO_DMA_SPI    49        // interrupt number for DMA SPI
#define INT_NO_DMA_U1T    50        // interrupt number for DMA UART1 TX
#define INT_NO_DMA_U1R    51        // interrupt number for DMA UART1 RX
#define INT_NO_DMA_U2T    52        // interrupt number for DMA UART2 TX
#define INT_NO_DMA_U2R    53        // interrupt number for DMA UART2 RX
#define INT_NO_DMA_U3T    54        // interrupt number for DMA UART3 TX
#define INT_NO_DMA_U3R    55        // interrupt number for DMA UART3 RX
#define INT_NO_DMA_U4T    56        // interrupt number for DMA UART4 TX
#define INT_NO_DMA_U4R    57        // interrupt number for DMA UART4 RX
#define INT_NO_DMA_LCM    58        // interrupt number for DMA LCM
#define INT_NO_LCM        59        // interrupt number for LCM

// Interrupt vector addresses
#define INT_ADDR_INT0     0x0003    // interrupt vector address for INT0
#define INT_ADDR_TMR0     0x000B    // interrupt vector address for timer0
#define INT_ADDR_INT1     0x0013    // interrupt vector address for INT1
#define INT_ADDR_TMR1     0x001B    // interrupt vector address for timer1
#define INT_ADDR_UART1    0x0023    // interrupt vector address for UART1
#define INT_ADDR_ADC      0x002B    // interrupt vector address for ADC
#define INT_ADDR_LVD      0x0033    // interrupt vector address for LVD
#define INT_ADDR_PCA      0x003B    // interrupt vector address for PCA
#define INT_ADDR_UART2    0x0043    // interrupt vector address for UART2
#define INT_ADDR_SPI      0x004B    // interrupt vector address for SPI
#define INT_ADDR_INT2     0x0053    // interrupt vector address for INT2
#define INT_ADDR_INT3     0x005B    // interrupt vector address for INT3
#define INT_ADDR_TMR2     0x0063    // interrupt vector address for timer2
#define INT_ADDR_INT4     0x0083    // interrupt vector address for INT4
#define INT_ADDR_UART3    0x008B    // interrupt vector address for UART3
#define INT_ADDR_UART4    0x0093    // interrupt vector address for UART4
#define INT_ADDR_TMR3     0x009B    // interrupt vector address for timer3
#define INT_ADDR_TMR4     0x00A3    // interrupt vector address for timer4
#define INT_ADDR_CMP      0x00AB    // interrupt vector address for CMP
#define INT_ADDR_I2C      0x00C3    // interrupt vector address for I2C
#define INT_ADDR_USB      0x00CB    // interrupt vector address for USB
#define INT_ADDR_PWMA     0x00D3    // interrupt vector address for PWMA
#define INT_ADDR_PWMB     0x00DB    // interrupt vector address for PWMB
#define INT_ADDR_TKSU     0x011B    // interrupt vector address for TKSU
#define INT_ADDR_RTC      0x0123    // interrupt vector address for RTC
#define INT_ADDR_P0       0x012B    // interrupt vector address for P0
#define INT_ADDR_P1       0x0133    // interrupt vector address for P1
#define INT_ADDR_P2       0x013B    // interrupt vector address for P2
#define INT_ADDR_P3       0x0143    // interrupt vector address for P3
#define INT_ADDR_P4       0x014B    // interrupt vector address for P4
#define INT_ADDR_P5       0x0153    // interrupt vector address for P5
#define INT_ADDR_P6       0x015B    // interrupt vector address for P6
#define INT_ADDR_P7       0x0163    // interrupt vector address for P7
#define INT_ADDR_DMA_M2M  0x017B    // interrupt vector address for DMA
#define INT_ADDR_DMA_ADC  0x0183    // interrupt vector address for DMA
#define INT_ADDR_DMA_SPI  0x018B    // interrupt vector address for DMA
#define INT_ADDR_DMA_U1T  0x0193    // interrupt vector address for DMA
#define INT_ADDR_DMA_U1R  0x019B    // interrupt vector address for DMA
#define INT_ADDR_DMA_U2T  0x01A3    // interrupt vector address for DMA
#define INT_ADDR_DMA_U2R  0x01AB    // interrupt vector address for DMA
#define INT_ADDR_DMA_U3T  0x01B3    // interrupt vector address for DMA
#define INT_ADDR_DMA_U3R  0x01BB    // interrupt vector address for DMA
#define INT_ADDR_DMA_U4T  0x01C3    // interrupt vector address for DMA
#define INT_ADDR_DMA_U4R  0x01CB    // interrupt vector address for DMA
#define INT_ADDR_DMA_LCM  0x01D3    // interrupt vector address for DMA
#define INT_ADDR_LCM      0x01DB    // interrupt vector address for LCM

// Peripheral register addresses
#define  _P0            0x80
SFR(P0,                 _P0);
SBIT(PP00,              _P0, 0);
SBIT(PP01,              _P0, 1);
SBIT(PP02,              _P0, 2);
SBIT(PP03,              _P0, 3);
SBIT(PP04,              _P0, 4);
SBIT(PP05,              _P0, 5);
SBIT(PP06,              _P0, 6);
SBIT(PP07,              _P0, 7);
SFR(SP,                 0x81);
SFR(DPL,                0x82);
SFR(DPH,                0x83);
SFR(S4CON,              0x84);
SFR(S4BUF,              0x85);
SFR(PCON,               0x87);

#define  _TCON          0x88
SFR(TCON,               _TCON);
SBIT(TF1,               _TCON, 7);
SBIT(TR1,               _TCON, 6);
SBIT(TF0,               _TCON, 5);
SBIT(TR0,               _TCON, 4);
SBIT(IE1,               _TCON, 3);
SBIT(IT1,               _TCON, 2);
SBIT(IE0,               _TCON, 1);
SBIT(IT0,               _TCON, 0);
SFR(TMOD,               0x89);

SFR(TL0,                0x8A);
SFR(TL1,                0x8B);
SFR(TH0,                0x8C);
SFR(TH1,                0x8D);
SFR(AUXR,               0x8E);
SFR(INTCLKO,            0x8F);

