wagiminator/Development-Boards/STC8H1K08_DevBoard/software/serial/include/stc8h.h
#define  _P1            0x90
SFR(P1,                 _P1);
SBIT(PP10,              _P1, 0);
SBIT(PP11,              _P1, 1);
SBIT(PP12,              _P1, 2);
SBIT(PP13,              _P1, 3);
SBIT(PP14,              _P1, 4);
SBIT(PP15,              _P1, 5);
SBIT(PP16,              _P1, 6);
SBIT(PP17,              _P1, 7);
SFR(P1M1,               0x91);
SFR(P1M0,               0x92);
SFR(P0M1,               0x93);
SFR(P0M0,               0x94);
SFR(P2M1,               0x95);
SFR(P2M0,               0x96);

#define  _SCON          0x98
SFR(SCON,               _SCON);
SBIT(SM0,               _SCON, 7);
SBIT(SM1,               _SCON, 6);
SBIT(SM2,               _SCON, 5);
SBIT(REN,               _SCON, 4);
SBIT(TB8,               _SCON, 3);
SBIT(RB8,               _SCON, 2);
SBIT(TI,                _SCON, 1);
SBIT(RI,                _SCON, 0);
SFR(SBUF,               0x99);
SFR(S2CON,              0x9A);
SFR(S2BUF,              0x9B);
SFR(IRCBAND,            0x9D);
SFR(LIRTRIM,            0x9E);
SFR(IRTRIM,             0x9F);

#define  _P2            0xA0
SFR(P2,                 _P2);
SBIT(PP20,              _P2, 0);
SBIT(PP21,              _P2, 1);
SBIT(PP22,              _P2, 2);
SBIT(PP23,              _P2, 3);
SBIT(PP24,              _P2, 4);
SBIT(PP25,              _P2, 5);
SBIT(PP26,              _P2, 6);
SBIT(PP27,              _P2, 7);
SFR(BUS_SPEED,          0xA1);
SFR(P_SW1,              0xA2);

#define  _IE            0xA8
SFR(IE,                 _IE);
SBIT(EA,                _IE, 7);
SBIT(ELVD,              _IE, 6);
SBIT(EADC,              _IE, 5);
SBIT(ES,                _IE, 4);
SBIT(ET1,               _IE, 3);
SBIT(EX1,               _IE, 2);
SBIT(ET0,               _IE, 1);
SBIT(EX0,               _IE, 0);
SFR(SADDR,              0xA9);
SFR(WKTCL,              0xAA);
SFR(WKTCH,              0xAB);
SFR(S3CON,              0xAC);
SFR(S3BUF,              0xAD);
SFR(TA,                 0xAE);
SFR(IE2,                0xAF);

#define  _P3            0xB0
SFR(P3,                 _P3);
SBIT(PP30,              _P3, 0);
SBIT(PP31,              _P3, 1);
SBIT(PP32,              _P3, 2);
SBIT(PP33,              _P3, 3);
SBIT(PP34,              _P3, 4);
SBIT(PP35,              _P3, 5);
SBIT(PP36,              _P3, 6);
SBIT(PP37,              _P3, 7);
SFR(P3M1,               0xB1);
SFR(P3M0,               0xB2);
SFR(P4M1,               0xB3);
SFR(P4M0,               0xB4);
SFR(IP2,                0xB5);
SFR(IP2H,               0xB6);
SFR(IPH,                0xB7);

#define  _IP            0xB8
SFR(IP,                 _IP);
SBIT(PPCA,              _IP, 7);
SBIT(PLVD,              _IP, 6);
SBIT(PADC,              _IP, 5);
SBIT(PS,                _IP, 4);
SBIT(PT1,               _IP, 3);
SBIT(PX1,               _IP, 2);
SBIT(PT0,               _IP, 1);
SBIT(PX0,               _IP, 0);
SFR(SADEN,              0xB9);
SFR(P_SW2,              0xBA);
SFR(ADC_CONTR,          0xBC);
SFR(ADC_RES,            0xBD);
SFR(ADC_RESL,           0xBE);

#define  _P4            0xC0
SFR(P4,                 _P4);
SBIT(PP40,              _P4, 0);
SBIT(PP41,              _P4, 1);
SBIT(PP42,              _P4, 2);
SBIT(PP43,              _P4, 3);
SBIT(PP44,              _P4, 4);
SBIT(PP45,              _P4, 5);
SBIT(PP46,              _P4, 6);
SBIT(PP47,              _P4, 7);
SFR(WDT_CONTR,          0xC1);
SFR(IAP_DATA,           0xC2);
SFR(IAP_ADDRH,          0xC3);
SFR(IAP_ADDRL,          0xC4);
SFR(IAP_CMD,            0xC5);
SFR(IAP_TRIG,           0xC6);
SFR(IAP_CONTR,          0xC7);

#define  _P5            0xC8
SFR(P5,                 _P5);
SBIT(PP50,              _P5, 0);
SBIT(PP51,              _P5, 1);
SBIT(PP52,              _P5, 2);
SBIT(PP53,              _P5, 3);
SBIT(PP54,              _P5, 4);
SBIT(PP55,              _P5, 5);
SBIT(PP56,              _P5, 6);
SBIT(PP57,              _P5, 7);
SFR(P5M1,               0xC9);
SFR(P5M0,               0xCA);
SFR(P6M1,               0xCB);
SFR(P6M0,               0xCC);
SFR(SPSTAT,             0xCD);
SFR(SPCTL,              0xCE);
SFR(SPDAT,              0xCF);

#define  _PSW           0xD0
SFR(PSW,                _PSW);
SBIT(CY,                _PSW, 7);
SBIT(AC,                _PSW, 6);
SBIT(F0,                _PSW, 5);
SBIT(RS1,               _PSW, 4);
SBIT(RS0,               _PSW, 3);
SBIT(OV,                _PSW, 2);
SBIT(F1,                _PSW, 1);
SBIT(P,                 _PSW, 0);
SFR(T4T3M,              0xD1);
SFR(T4H,                0xD2);
SFR(T4L,                0xD3);
SFR(T3H,                0xD4);
SFR(T3L,                0xD5);
SFR(T2H,                0xD6);
SFR(T2L,                0xD7);

SFR(ACC,                0xE0);

#define  _P6            0xE8
SFR(P6,                 _P6);
SBIT(PP60,              _P6, 0);
SBIT(PP61,              _P6, 1);
SBIT(PP62,              _P6, 2);
SBIT(PP63,              _P6, 3);
SBIT(PP64,              _P6, 4);
SBIT(PP65,              _P6, 5);
SBIT(PP66,              _P6, 6);
SBIT(PP67,              _P6, 7);

SFR(B,                  0xF0);

#define  _P7            0xF8
SFR(P7,                 _P7);
SBIT(PP70,              _P7, 0);
SBIT(PP71,              _P7, 1);
SBIT(PP72,              _P7, 2);
SBIT(PP73,              _P7, 3);
SBIT(PP74,              _P7, 4);
SBIT(PP75,              _P7, 5);
SBIT(PP76,              _P7, 6);
SBIT(PP77,              _P7, 7);

SFR(VRTRIM,             0xA6);

SFR(USBCLK,             0xDC);

SFR(ADCCFG,             0xDE);
SFR(IP3,                0xDF);

SFR(P7M1,               0xE1);
SFR(P7M0,               0xE2);
SFR(DPS,                0xE3);
SFR(DPL1,               0xE4);
SFR(DPH1,               0xE5);
SFR(CMPCR1,             0xE6);
SFR(CMPCR2,             0xE7);

SFR(USBDAT,             0xEC);
SFR(IP3H,               0xEE);
SFR(AUXINTIF,           0xEF);

SFR(USBCON,             0xF4);

SFR(IAP_TPS,            0xF5);

SFR(USBADR,             0xFC);

SFR(RSTCFG,             0xFF);

// XDATA registers
// Set B7 of P_SW2 before read/write the following registers
#define CKSEL             (*(uint8_t volatile __XDATA *)0xfe00)
#define CLKDIV            (*(uint8_t volatile __XDATA *)0xfe01)
#define IRCCR             (*(uint8_t volatile __XDATA *)0xfe02)
#define HIRCCR            (*(uint8_t volatile __XDATA *)0xfe02)
#define XOSCCR            (*(uint8_t volatile __XDATA *)0xfe03)
#define IRC32KCR          (*(uint8_t volatile __XDATA *)0xfe04)
#define MCLKOCR           (*(uint8_t volatile __XDATA *)0xfe05)
#define IRCDB             (*(uint8_t volatile __XDATA *)0xfe06)
#define IRC48MCR          (*(uint8_t volatile __XDATA *)0xfe07)
#define X32KCR            (*(uint8_t volatile __XDATA *)0xfe08)
#define RSTFLAG           (*(uint8_t volatile __XDATA *)0xfe09)
#define PxPU                                             0xfe10
#define P0PU                                     SFRX(PxPU + 0)
#define P1PU                                     SFRX(PxPU + 1)
#define P2PU              (*(uint8_t volatile __XDATA *)0xfe12)
#define P3PU              (*(uint8_t volatile __XDATA *)0xfe13)
#define P4PU              (*(uint8_t volatile __XDATA *)0xfe14)
#define P5PU              (*(uint8_t volatile __XDATA *)0xfe15)
#define P6PU              (*(uint8_t volatile __XDATA *)0xfe16)
#define P7PU              (*(uint8_t volatile __XDATA *)0xfe17)
#define PxNCS                                            0xfe18
#define P0NCS             (*(uint8_t volatile __XDATA *)0xfe18)
#define P1NCS             (*(uint8_t volatile __XDATA *)0xfe19)
#define P2NCS             (*(uint8_t volatile __XDATA *)0xfe1a)
#define P3NCS             (*(uint8_t volatile __XDATA *)0xfe1b)
#define P4NCS             (*(uint8_t volatile __XDATA *)0xfe1c)
#define P5NCS             (*(uint8_t volatile __XDATA *)0xfe1d)
#define P6NCS             (*(uint8_t volatile __XDATA *)0xfe1e)
#define P7NCS             (*(uint8_t volatile __XDATA *)0xfe1f)
#define PxSR                                             0xfe20
#define P0SR              (*(uint8_t volatile __XDATA *)0xfe20)
#define P1SR              (*(uint8_t volatile __XDATA *)0xfe21)
#define P2SR              (*(uint8_t volatile __XDATA *)0xfe22)
#define P3SR              (*(uint8_t volatile __XDATA *)0xfe23)
#define P4SR              (*(uint8_t volatile __XDATA *)0xfe24)
#define P5SR              (*(uint8_t volatile __XDATA *)0xfe25)
#define P6SR              (*(uint8_t volatile __XDATA *)0xfe26)
#define P7SR              (*(uint8_t volatile __XDATA *)0xfe27)
#define PxDR                                             0xfe28
#define P0DR              (*(uint8_t volatile __XDATA *)0xfe28)
#define P1DR              (*(uint8_t volatile __XDATA *)0xfe29)
#define P2DR              (*(uint8_t volatile __XDATA *)0xfe2a)
#define P3DR              (*(uint8_t volatile __XDATA *)0xfe2b)
#define P4DR              (*(uint8_t volatile __XDATA *)0xfe2c)
#define P5DR              (*(uint8_t volatile __XDATA *)0xfe2d)
#define P6DR              (*(uint8_t volatile __XDATA *)0xfe2e)
#define P7DR              (*(uint8_t volatile __XDATA *)0xfe2f)
#define PxIE                                             0xfe30
#define P0IE              (*(uint8_t volatile __XDATA *)0xfe30)
#define P1IE              (*(uint8_t volatile __XDATA *)0xfe31)
#define P2IE              (*(uint8_t volatile __XDATA *)0xfe32)
#define P3IE              (*(uint8_t volatile __XDATA *)0xfe33)
#define P4IE              (*(uint8_t volatile __XDATA *)0xfe34)
#define P5IE              (*(uint8_t volatile __XDATA *)0xfe35)
#define P6IE              (*(uint8_t volatile __XDATA *)0xfe36)
#define P7IE              (*(uint8_t volatile __XDATA *)0xfe37)
#define LCMIFCFG          (*(uint8_t volatile __XDATA *)0xfe50)
#define RTCCR             (*(uint8_t volatile __XDATA *)0xfe60)
#define RTCCFG            (*(uint8_t volatile __XDATA *)0xfe61)
#define RTCIEN            (*(uint8_t volatile __XDATA *)0xfe62)
#define RTCIF             (*(uint8_t volatile __XDATA *)0xfe63)
#define ALAHOUR           (*(uint8_t volatile __XDATA *)0xfe64)
#define ALAMIN            (*(uint8_t volatile __XDATA *)0xfe65)
#define ALASEC            (*(uint8_t volatile __XDATA *)0xfe66)
#define ALASSEC           (*(uint8_t volatile __XDATA *)0xfe67)
#define INIYEAR           (*(uint8_t volatile __XDATA *)0xfe68)
#define INIMONTH          (*(uint8_t volatile __XDATA *)0xfe69)
#define INIDAY            (*(uint8_t volatile __XDATA *)0xfe6a)
#define INIHOUR           (*(uint8_t volatile __XDATA *)0xfe6b)
#define INIMIN            (*(uint8_t volatile __XDATA *)0xfe6c)
#define INISEC            (*(uint8_t volatile __XDATA *)0xfe6d)
#define INISSEC           (*(uint8_t volatile __XDATA *)0xfe6e)
#define YEAR              (*(uint8_t volatile __XDATA *)0xfe70)
#define MONTH             (*(uint8_t volatile __XDATA *)0xfe71)
#define DAY               (*(uint8_t volatile __XDATA *)0xfe72)
#define HOUR              (*(uint8_t volatile __XDATA *)0xfe73)
#define MIN               (*(uint8_t volatile __XDATA *)0xfe74)
#define SEC               (*(uint8_t volatile __XDATA *)0xfe75)
#define SSEC              (*(uint8_t volatile __XDATA *)0xfe76)

#define I2CCFG            (*(uint8_t volatile __XDATA *)0xfe80)
#define I2CMSCR           (*(uint8_t volatile __XDATA *)0xfe81)
#define I2CMSST           (*(uint8_t volatile __XDATA *)0xfe82)
#define I2CSLCR           (*(uint8_t volatile __XDATA *)0xfe83)
#define I2CSLST           (*(uint8_t volatile __XDATA *)0xfe84)
#define I2CSLADR          (*(uint8_t volatile __XDATA *)0xfe85)
#define I2CTXD            (*(uint8_t volatile __XDATA *)0xfe86)
#define I2CRXD            (*(uint8_t volatile __XDATA *)0xfe87)
#define I2CMSAUX          (*(uint8_t volatile __XDATA *)0xfe88)

#define TM2PS             (*(uint8_t volatile __XDATA *)0xfea2)
#define TM3PS             (*(uint8_t volatile __XDATA *)0xfea3)
#define TM4PS             (*(uint8_t volatile __XDATA *)0xfea4)
#define ADCTIM            (*(uint8_t volatile __XDATA *)0xfea8)

