wagiminator/Development-Boards/STC8H1K08_DevBoard/software/serial/include/stc8h.h
#define PWMA_ETRPS        (*(uint8_t volatile __XDATA *)0xfeb0)
#define PWMA_ENO          (*(uint8_t volatile __XDATA *)0xfeb1)
#define PWMA_PS           (*(uint8_t volatile __XDATA *)0xfeb2)
#define PWMA_IOAUX        (*(uint8_t volatile __XDATA *)0xfeb3)
#define PWMB_ETRPS        (*(uint8_t volatile __XDATA *)0xfeb4)
#define PWMB_ENO          (*(uint8_t volatile __XDATA *)0xfeb5)
#define PWMB_PS           (*(uint8_t volatile __XDATA *)0xfeb6)
#define PWMB_IOAUX        (*(uint8_t volatile __XDATA *)0xfeb7)
#define PWMA_CR1          (*(uint8_t volatile __XDATA *)0xfec0)
#define PWMA_CR2          (*(uint8_t volatile __XDATA *)0xfec1)
#define PWMA_SMCR         (*(uint8_t volatile __XDATA *)0xfec2)
#define PWMA_ETR          (*(uint8_t volatile __XDATA *)0xfec3)
#define PWMA_IER          (*(uint8_t volatile __XDATA *)0xfec4)
#define PWMA_SR1          (*(uint8_t volatile __XDATA *)0xfec5)
#define PWMA_SR2          (*(uint8_t volatile __XDATA *)0xfec6)
#define PWMA_EGR          (*(uint8_t volatile __XDATA *)0xfec7)
#define PWMA_CCMRx                                       0xfec8
#define PWMA_CCMR1        (*(uint8_t volatile __XDATA *)0xfec8)
#define PWMA_CCMR2        (*(uint8_t volatile __XDATA *)0xfec9)
#define PWMA_CCMR3        (*(uint8_t volatile __XDATA *)0xfeca)
#define PWMA_CCMR4        (*(uint8_t volatile __XDATA *)0xfecb)
#define PWMA_CCER1        (*(uint8_t volatile __XDATA *)0xfecc)
#define PWMA_CCER2        (*(uint8_t volatile __XDATA *)0xfecd)

#define PWMA_CNTRH        (*(uint8_t volatile __XDATA *)0xfece)
#define PWMA_CNTRL        (*(uint8_t volatile __XDATA *)0xfecf)

#define PWMA_PSCRH        (*(uint8_t volatile __XDATA *)0xfed0)
#define PWMA_PSCRL        (*(uint8_t volatile __XDATA *)0xfed1)

#define PWMA_ARRH         (*(uint8_t volatile __XDATA *)0xfed2)
#define PWMA_ARRL         (*(uint8_t volatile __XDATA *)0xfed3)
#define PWMA_RCR          (*(uint8_t volatile __XDATA *)0xfed4)

#define PWMA_CCR1H        (*(uint8_t volatile __XDATA *)0xfed5)
#define PWMA_CCR1L        (*(uint8_t volatile __XDATA *)0xfed6)

#define PWMA_CCR2H        (*(uint8_t volatile __XDATA *)0xfed7)
#define PWMA_CCR2L        (*(uint8_t volatile __XDATA *)0xfed8)

#define PWMA_CCR3H        (*(uint8_t volatile __XDATA *)0xfed9)
#define PWMA_CCR3L        (*(uint8_t volatile __XDATA *)0xfeda)

#define PWMA_CCR4H        (*(uint8_t volatile __XDATA *)0xfedb)
#define PWMA_CCR4L        (*(uint8_t volatile __XDATA *)0xfedc)
#define PWMA_BKR          (*(uint8_t volatile __XDATA *)0xfedd)
#define PWMA_DTR          (*(uint8_t volatile __XDATA *)0xfede)
#define PWMA_OISR         (*(uint8_t volatile __XDATA *)0xfedf)
#define PWMB_CR1          (*(uint8_t volatile __XDATA *)0xfee0)
#define PWMB_CR2          (*(uint8_t volatile __XDATA *)0xfee1)
#define PWMB_SMCR         (*(uint8_t volatile __XDATA *)0xfee2)
#define PWMB_ETR          (*(uint8_t volatile __XDATA *)0xfee3)
#define PWMB_IER          (*(uint8_t volatile __XDATA *)0xfee4)
#define PWMB_SR1          (*(uint8_t volatile __XDATA *)0xfee5)
#define PWMB_SR2          (*(uint8_t volatile __XDATA *)0xfee6)
#define PWMB_EGR          (*(uint8_t volatile __XDATA *)0xfee7)
#define PWMB_CCMRx                                       0xfee8
#define PWMB_CCMR1        (*(uint8_t volatile __XDATA *)0xfee8)
#define PWMB_CCMR2        (*(uint8_t volatile __XDATA *)0xfee9)
#define PWMB_CCMR3        (*(uint8_t volatile __XDATA *)0xfeea)
#define PWMB_CCMR4        (*(uint8_t volatile __XDATA *)0xfeeb)
#define PWMB_CCER1        (*(uint8_t volatile __XDATA *)0xfeec)
#define PWMB_CCER2        (*(uint8_t volatile __XDATA *)0xfeed)

#define PWMB_CNTRH        (*(uint8_t volatile __XDATA *)0xfeee)
#define PWMB_CNTRL        (*(uint8_t volatile __XDATA *)0xfeef)

#define PWMB_PSCRH        (*(uint8_t volatile __XDATA *)0xfef0)
#define PWMB_PSCRL        (*(uint8_t volatile __XDATA *)0xfef1)

#define PWMB_ARRH         (*(uint8_t volatile __XDATA *)0xfef2)
#define PWMB_ARRL         (*(uint8_t volatile __XDATA *)0xfef3)
#define PWMB_RCR          (*(uint8_t volatile __XDATA *)0xfef4)

#define PWMB_CCR5H        (*(uint8_t volatile __XDATA *)0xfef5)
#define PWMB_CCR5L        (*(uint8_t volatile __XDATA *)0xfef6)

#define PWMB_CCR6H        (*(uint8_t volatile __XDATA *)0xfef7)
#define PWMB_CCR6L        (*(uint8_t volatile __XDATA *)0xfef8)

#define PWMB_CCR7H        (*(uint8_t volatile __XDATA *)0xfef9)
#define PWMB_CCR7L        (*(uint8_t volatile __XDATA *)0xfefa)

#define PWMB_CCR8H        (*(uint8_t volatile __XDATA *)0xfefb)
#define PWMB_CCR8L        (*(uint8_t volatile __XDATA *)0xfefc)
#define PWMB_BKR          (*(uint8_t volatile __XDATA *)0xfefd)
#define PWMB_DTR          (*(uint8_t volatile __XDATA *)0xfefe)
#define PWMB_OISR         (*(uint8_t volatile __XDATA *)0xfeff)

#define PxINTE                                           0xfd00
#define P0INTE            (*(uint8_t volatile __XDATA *)0xfd00)
#define P1INTE            (*(uint8_t volatile __XDATA *)0xfd01)
#define P2INTE            (*(uint8_t volatile __XDATA *)0xfd02)
#define P3INTE            (*(uint8_t volatile __XDATA *)0xfd03)
#define P4INTE            (*(uint8_t volatile __XDATA *)0xfd04)
#define P5INTE            (*(uint8_t volatile __XDATA *)0xfd05)
#define P6INTE            (*(uint8_t volatile __XDATA *)0xfd06)
#define P7INTE            (*(uint8_t volatile __XDATA *)0xfd07)
#define P0INTF            (*(uint8_t volatile __XDATA *)0xfd10)
#define P1INTF            (*(uint8_t volatile __XDATA *)0xfd11)
#define P2INTF            (*(uint8_t volatile __XDATA *)0xfd12)
#define P3INTF            (*(uint8_t volatile __XDATA *)0xfd13)
#define P4INTF            (*(uint8_t volatile __XDATA *)0xfd14)
#define P5INTF            (*(uint8_t volatile __XDATA *)0xfd15)
#define P6INTF            (*(uint8_t volatile __XDATA *)0xfd16)
#define P7INTF            (*(uint8_t volatile __XDATA *)0xfd17)
#define PxIM0                                            0xfd20
#define P0IM0             (*(uint8_t volatile __XDATA *)0xfd20)
#define P1IM0             (*(uint8_t volatile __XDATA *)0xfd21)
#define P2IM0             (*(uint8_t volatile __XDATA *)0xfd22)
#define P3IM0             (*(uint8_t volatile __XDATA *)0xfd23)
#define P4IM0             (*(uint8_t volatile __XDATA *)0xfd24)
#define P5IM0             (*(uint8_t volatile __XDATA *)0xfd25)
#define P6IM0             (*(uint8_t volatile __XDATA *)0xfd26)
#define P7IM0             (*(uint8_t volatile __XDATA *)0xfd27)
#define PxIM1                                            0xfd30
#define P0IM1             (*(uint8_t volatile __XDATA *)0xfd30)
#define P1IM1             (*(uint8_t volatile __XDATA *)0xfd31)
#define P2IM1             (*(uint8_t volatile __XDATA *)0xfd32)
#define P3IM1             (*(uint8_t volatile __XDATA *)0xfd33)
#define P4IM1             (*(uint8_t volatile __XDATA *)0xfd34)
#define P5IM1             (*(uint8_t volatile __XDATA *)0xfd35)
#define P6IM1             (*(uint8_t volatile __XDATA *)0xfd36)
#define P7IM1             (*(uint8_t volatile __XDATA *)0xfd37)
#define P0WKUE            (*(uint8_t volatile __XDATA *)0xfd40)
#define P1WKUE            (*(uint8_t volatile __XDATA *)0xfd41)
#define P2WKUE            (*(uint8_t volatile __XDATA *)0xfd42)
#define P3WKUE            (*(uint8_t volatile __XDATA *)0xfd43)
#define P4WKUE            (*(uint8_t volatile __XDATA *)0xfd44)
#define P5WKUE            (*(uint8_t volatile __XDATA *)0xfd45)
#define P6WKUE            (*(uint8_t volatile __XDATA *)0xfd46)
#define P7WKUE            (*(uint8_t volatile __XDATA *)0xfd47)
#define PIN_IP            (*(uint8_t volatile __XDATA *)0xfd60)
#define PIN_IPH           (*(uint8_t volatile __XDATA *)0xfd61)
#define CHIPIDxx                                         0xfde0
#define CHIPID00          (*(uint8_t volatile __XDATA *)0xfde0)

#define MD3               (*(uint8_t volatile __XDATA *)0xfcf0)
#define MD2               (*(uint8_t volatile __XDATA *)0xfcf1)
#define MD1               (*(uint8_t volatile __XDATA *)0xfcf2)
#define MD0               (*(uint8_t volatile __XDATA *)0xfcf3)
#define MD5               (*(uint8_t volatile __XDATA *)0xfcf4)
#define MD4               (*(uint8_t volatile __XDATA *)0xfcf5)
#define ARCON             (*(uint8_t volatile __XDATA *)0xfcf6)
#define OPCON             (*(uint8_t volatile __XDATA *)0xfcf7)

