wagiminator/Development-Boards/STC8H1K08_DevBoard/software/serial/include/stc8h.h
#define COMEN             (*(uint8_t volatile __XDATA *)0xfb00)
#define SEGENL            (*(uint8_t volatile __XDATA *)0xfb01)
#define SEGENH            (*(uint8_t volatile __XDATA *)0xfb02)
#define LEDCTRL           (*(uint8_t volatile __XDATA *)0xfb03)
#define LEDCKS            (*(uint8_t volatile __XDATA *)0xfb04)
#define COM0_DA_L         (*(uint8_t volatile __XDATA *)0xfb10)
#define COM1_DA_L         (*(uint8_t volatile __XDATA *)0xfb11)
#define COM2_DA_L         (*(uint8_t volatile __XDATA *)0xfb12)
#define COM3_DA_L         (*(uint8_t volatile __XDATA *)0xfb13)
#define COM4_DA_L         (*(uint8_t volatile __XDATA *)0xfb14)
#define COM5_DA_L         (*(uint8_t volatile __XDATA *)0xfb15)
#define COM6_DA_L         (*(uint8_t volatile __XDATA *)0xfb16)
#define COM7_DA_L         (*(uint8_t volatile __XDATA *)0xfb17)
#define COM0_DA_H         (*(uint8_t volatile __XDATA *)0xfb18)
#define COM1_DA_H         (*(uint8_t volatile __XDATA *)0xfb19)
#define COM2_DA_H         (*(uint8_t volatile __XDATA *)0xfb1a)
#define COM3_DA_H         (*(uint8_t volatile __XDATA *)0xfb1b)
#define COM4_DA_H         (*(uint8_t volatile __XDATA *)0xfb1c)
#define COM5_DA_H         (*(uint8_t volatile __XDATA *)0xfb1d)
#define COM6_DA_H         (*(uint8_t volatile __XDATA *)0xfb1e)
#define COM7_DA_H         (*(uint8_t volatile __XDATA *)0xfb1f)
#define COM0_DC_L         (*(uint8_t volatile __XDATA *)0xfb20)
#define COM1_DC_L         (*(uint8_t volatile __XDATA *)0xfb21)
#define COM2_DC_L         (*(uint8_t volatile __XDATA *)0xfb22)
#define COM3_DC_L         (*(uint8_t volatile __XDATA *)0xfb23)
#define COM4_DC_L         (*(uint8_t volatile __XDATA *)0xfb24)
#define COM5_DC_L         (*(uint8_t volatile __XDATA *)0xfb25)
#define COM6_DC_L         (*(uint8_t volatile __XDATA *)0xfb26)
#define COM7_DC_L         (*(uint8_t volatile __XDATA *)0xfb27)
#define COM0_DC_H         (*(uint8_t volatile __XDATA *)0xfb28)
#define COM1_DC_H         (*(uint8_t volatile __XDATA *)0xfb29)
#define COM2_DC_H         (*(uint8_t volatile __XDATA *)0xfb2a)
#define COM3_DC_H         (*(uint8_t volatile __XDATA *)0xfb2b)
#define COM4_DC_H         (*(uint8_t volatile __XDATA *)0xfb2c)
#define COM5_DC_H         (*(uint8_t volatile __XDATA *)0xfb2d)
#define COM6_DC_H         (*(uint8_t volatile __XDATA *)0xfb2e)
#define COM7_DC_H         (*(uint8_t volatile __XDATA *)0xfb2f)

#define TSCHEN1           (*(uint8_t volatile __XDATA *)0xfb40)
#define TSCHEN2           (*(uint8_t volatile __XDATA *)0xfb41)
#define TSCFG1            (*(uint8_t volatile __XDATA *)0xfb42)
#define TSCFG2            (*(uint8_t volatile __XDATA *)0xfb43)
#define TSWUTC            (*(uint8_t volatile __XDATA *)0xfb44)
#define TSCTRL            (*(uint8_t volatile __XDATA *)0xfb45)
#define TSSTA1            (*(uint8_t volatile __XDATA *)0xfb46)
#define TSSTA2            (*(uint8_t volatile __XDATA *)0xfb47)
#define TSRT              (*(uint8_t volatile __XDATA *)0xfb48)

#define TSDATH            (*(uint8_t volatile __XDATA *)0xfb49)
#define TSDATL            (*(uint8_t volatile __XDATA *)0xfb4A)

#define TSTH00H           (*(uint8_t volatile __XDATA *)0xfb50)
#define TSTH00L           (*(uint8_t volatile __XDATA *)0xfb51)

#define TSTH01H           (*(uint8_t volatile __XDATA *)0xfb52)
#define TSTH01L           (*(uint8_t volatile __XDATA *)0xfb53)

#define TSTH02H           (*(uint8_t volatile __XDATA *)0xfb54)
#define TSTH02L           (*(uint8_t volatile __XDATA *)0xfb55)

#define TSTH03H           (*(uint8_t volatile __XDATA *)0xfb56)
#define TSTH03L           (*(uint8_t volatile __XDATA *)0xfb57)

#define TSTH04H           (*(uint8_t volatile __XDATA *)0xfb58)
#define TSTH04L           (*(uint8_t volatile __XDATA *)0xfb59)

#define TSTH05H           (*(uint8_t volatile __XDATA *)0xfb5a)
#define TSTH05L           (*(uint8_t volatile __XDATA *)0xfb5b)

#define TSTH06H           (*(uint8_t volatile __XDATA *)0xfb5c)
#define TSTH06L           (*(uint8_t volatile __XDATA *)0xfb5d)

#define TSTH07H           (*(uint8_t volatile __XDATA *)0xfb5e)
#define TSTH07L           (*(uint8_t volatile __XDATA *)0xfb5f)

#define TSTH08H           (*(uint8_t volatile __XDATA *)0xfb60)
#define TSTH08L           (*(uint8_t volatile __XDATA *)0xfb61)

#define TSTH09H           (*(uint8_t volatile __XDATA *)0xfb62)
#define TSTH09L           (*(uint8_t volatile __XDATA *)0xfb63)

#define TSTH10H           (*(uint8_t volatile __XDATA *)0xfb64)
#define TSTH10L           (*(uint8_t volatile __XDATA *)0xfb65)

#define TSTH11H           (*(uint8_t volatile __XDATA *)0xfb66)
#define TSTH11L           (*(uint8_t volatile __XDATA *)0xfb67)

#define TSTH12H           (*(uint8_t volatile __XDATA *)0xfb68)
#define TSTH12L           (*(uint8_t volatile __XDATA *)0xfb69)

#define TSTH13H           (*(uint8_t volatile __XDATA *)0xfb6a)
#define TSTH13L           (*(uint8_t volatile __XDATA *)0xfb6b)

#define TSTH14H           (*(uint8_t volatile __XDATA *)0xfb6c)
#define TSTH14L           (*(uint8_t volatile __XDATA *)0xfb6d)

#define TSTH15H           (*(uint8_t volatile __XDATA *)0xfb6e)
#define TSTH15L           (*(uint8_t volatile __XDATA *)0xfb6f)

#define DMA_M2M_CFG       (*(uint8_t volatile __XDATA *)0xfa00)
#define DMA_M2M_CR        (*(uint8_t volatile __XDATA *)0xfa01)
#define DMA_M2M_STA       (*(uint8_t volatile __XDATA *)0xfa02)
#define DMA_M2M_AMT       (*(uint8_t volatile __XDATA *)0xfa03)
#define DMA_M2M_DONE      (*(uint8_t volatile __XDATA *)0xfa04)
#define DMA_M2M_TXAH      (*(uint8_t volatile __XDATA *)0xfa05)
#define DMA_M2M_TXAL      (*(uint8_t volatile __XDATA *)0xfa06)
#define DMA_M2M_RXAH      (*(uint8_t volatile __XDATA *)0xfa07)
#define DMA_M2M_RXAL      (*(uint8_t volatile __XDATA *)0xfa08)

#define DMA_ADC_CFG       (*(uint8_t volatile __XDATA *)0xfa10)
#define DMA_ADC_CR        (*(uint8_t volatile __XDATA *)0xfa11)
#define DMA_ADC_STA       (*(uint8_t volatile __XDATA *)0xfa12)
#define DMA_ADC_RXAH      (*(uint8_t volatile __XDATA *)0xfa17)
#define DMA_ADC_RXAL      (*(uint8_t volatile __XDATA *)0xfa18)
#define DMA_ADC_CFG2      (*(uint8_t volatile __XDATA *)0xfa19)
#define DMA_ADC_CHSW0     (*(uint8_t volatile __XDATA *)0xfa1a)
#define DMA_ADC_CHSW1     (*(uint8_t volatile __XDATA *)0xfa1b)

#define DMA_SPI_CFG       (*(uint8_t volatile __XDATA *)0xfa20)
#define DMA_SPI_CR        (*(uint8_t volatile __XDATA *)0xfa21)
#define DMA_SPI_STA       (*(uint8_t volatile __XDATA *)0xfa22)
#define DMA_SPI_AMT       (*(uint8_t volatile __XDATA *)0xfa23)
#define DMA_SPI_DONE      (*(uint8_t volatile __XDATA *)0xfa24)
#define DMA_SPI_TXAH      (*(uint8_t volatile __XDATA *)0xfa25)
#define DMA_SPI_TXAL      (*(uint8_t volatile __XDATA *)0xfa26)
#define DMA_SPI_RXAH      (*(uint8_t volatile __XDATA *)0xfa27)
#define DMA_SPI_RXAL      (*(uint8_t volatile __XDATA *)0xfa28)
#define DMA_SPI_CFG2      (*(uint8_t volatile __XDATA *)0xfa29)

#define DMA_UR1T_CFG      (*(uint8_t volatile __XDATA *)0xfa30)
#define DMA_UR1T_CR       (*(uint8_t volatile __XDATA *)0xfa31)
#define DMA_UR1T_STA      (*(uint8_t volatile __XDATA *)0xfa32)
#define DMA_UR1T_AMT      (*(uint8_t volatile __XDATA *)0xfa33)
#define DMA_UR1T_DONE     (*(uint8_t volatile __XDATA *)0xfa34)
#define DMA_UR1T_TXAH     (*(uint8_t volatile __XDATA *)0xfa35)
#define DMA_UR1T_TXAL     (*(uint8_t volatile __XDATA *)0xfa36)
#define DMA_UR1R_CFG      (*(uint8_t volatile __XDATA *)0xfa38)
#define DMA_UR1R_CR       (*(uint8_t volatile __XDATA *)0xfa39)
#define DMA_UR1R_STA      (*(uint8_t volatile __XDATA *)0xfa3a)
#define DMA_UR1R_AMT      (*(uint8_t volatile __XDATA *)0xfa3b)
#define DMA_UR1R_DONE     (*(uint8_t volatile __XDATA *)0xfa3c)
#define DMA_UR1R_RXAH     (*(uint8_t volatile __XDATA *)0xfa3d)
#define DMA_UR1R_RXAL     (*(uint8_t volatile __XDATA *)0xfa3e)

#define DMA_UR2T_CFG      (*(uint8_t volatile __XDATA *)0xfa40)
#define DMA_UR2T_CR       (*(uint8_t volatile __XDATA *)0xfa41)
#define DMA_UR2T_STA      (*(uint8_t volatile __XDATA *)0xfa42)
#define DMA_UR2T_AMT      (*(uint8_t volatile __XDATA *)0xfa43)
#define DMA_UR2T_DONE     (*(uint8_t volatile __XDATA *)0xfa44)
#define DMA_UR2T_TXAH     (*(uint8_t volatile __XDATA *)0xfa45)
#define DMA_UR2T_TXAL     (*(uint8_t volatile __XDATA *)0xfa46)
#define DMA_UR2R_CFG      (*(uint8_t volatile __XDATA *)0xfa48)
#define DMA_UR2R_CR       (*(uint8_t volatile __XDATA *)0xfa49)
#define DMA_UR2R_STA      (*(uint8_t volatile __XDATA *)0xfa4a)
#define DMA_UR2R_AMT      (*(uint8_t volatile __XDATA *)0xfa4b)
#define DMA_UR2R_DONE     (*(uint8_t volatile __XDATA *)0xfa4c)
#define DMA_UR2R_RXAH     (*(uint8_t volatile __XDATA *)0xfa4d)
#define DMA_UR2R_RXAL     (*(uint8_t volatile __XDATA *)0xfa4e)

#define DMA_UR3T_CFG      (*(uint8_t volatile __XDATA *)0xfa50)
#define DMA_UR3T_CR       (*(uint8_t volatile __XDATA *)0xfa51)
#define DMA_UR3T_STA      (*(uint8_t volatile __XDATA *)0xfa52)
#define DMA_UR3T_AMT      (*(uint8_t volatile __XDATA *)0xfa53)
#define DMA_UR3T_DONE     (*(uint8_t volatile __XDATA *)0xfa54)
#define DMA_UR3T_TXAH     (*(uint8_t volatile __XDATA *)0xfa55)
#define DMA_UR3T_TXAL     (*(uint8_t volatile __XDATA *)0xfa56)
#define DMA_UR3R_CFG      (*(uint8_t volatile __XDATA *)0xfa58)
#define DMA_UR3R_CR       (*(uint8_t volatile __XDATA *)0xfa59)
#define DMA_UR3R_STA      (*(uint8_t volatile __XDATA *)0xfa5a)
#define DMA_UR3R_AMT      (*(uint8_t volatile __XDATA *)0xfa5b)
#define DMA_UR3R_DONE     (*(uint8_t volatile __XDATA *)0xfa5c)
#define DMA_UR3R_RXAH     (*(uint8_t volatile __XDATA *)0xfa5d)
#define DMA_UR3R_RXAL     (*(uint8_t volatile __XDATA *)0xfa5e)

#define DMA_UR4T_CFG      (*(uint8_t volatile __XDATA *)0xfa60)
#define DMA_UR4T_CR       (*(uint8_t volatile __XDATA *)0xfa61)
#define DMA_UR4T_STA      (*(uint8_t volatile __XDATA *)0xfa62)
#define DMA_UR4T_AMT      (*(uint8_t volatile __XDATA *)0xfa63)
#define DMA_UR4T_DONE     (*(uint8_t volatile __XDATA *)0xfa64)
#define DMA_UR4T_TXAH     (*(uint8_t volatile __XDATA *)0xfa65)
#define DMA_UR4T_TXAL     (*(uint8_t volatile __XDATA *)0xfa66)
#define DMA_UR4R_CFG      (*(uint8_t volatile __XDATA *)0xfa68)
#define DMA_UR4R_CR       (*(uint8_t volatile __XDATA *)0xfa69)
#define DMA_UR4R_STA      (*(uint8_t volatile __XDATA *)0xfa6a)
#define DMA_UR4R_AMT      (*(uint8_t volatile __XDATA *)0xfa6b)
#define DMA_UR4R_DONE     (*(uint8_t volatile __XDATA *)0xfa6c)
#define DMA_UR4R_RXAH     (*(uint8_t volatile __XDATA *)0xfa6d)
#define DMA_UR4R_RXAL     (*(uint8_t volatile __XDATA *)0xfa6e)

#define DMA_LCM_CFG       (*(uint8_t volatile __XDATA *)0xfa70)
#define DMA_LCM_CR        (*(uint8_t volatile __XDATA *)0xfa71)
#define DMA_LCM_STA       (*(uint8_t volatile __XDATA *)0xfa72)
#define DMA_LCM_AMT       (*(uint8_t volatile __XDATA *)0xfa73)
#define DMA_LCM_DONE      (*(uint8_t volatile __XDATA *)0xfa74)
#define DMA_LCM_TXAH      (*(uint8_t volatile __XDATA *)0xfa75)
#define DMA_LCM_TXAL      (*(uint8_t volatile __XDATA *)0xfa76)
#define DMA_LCM_RXAH      (*(uint8_t volatile __XDATA *)0xfa77)
#define DMA_LCM_RXAL      (*(uint8_t volatile __XDATA *)0xfa78)
